{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "input_shape": [
                                48,
                                48,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_6"
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_46",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_48",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_47",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_9",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_12",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.25,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_48",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_49",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_49",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 128,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_10",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_13",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.25,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_50",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 256,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "valid",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "BatchNormalization",
                        "config": {
                            "name": "batch_normalization_50",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "axis": -1,
                            "momentum": 0.99,
                            "epsilon": 0.001,
                            "center": true,
                            "scale": true,
                            "beta_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "gamma_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_mean_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "moving_variance_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Ones",
                                "config": {},
                                "registered_name": null
                            },
                            "beta_regularizer": null,
                            "gamma_regularizer": null,
                            "beta_constraint": null,
                            "gamma_constraint": null,
                            "synchronized": false
                        }
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_11",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_14",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.25,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Flatten",
                        "config": {
                            "name": "flatten_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "data_format": "channels_last"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_19",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 512,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_15",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.5,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_20",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 256,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_16",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.3,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_21",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 7,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ],
                "build_input_shape": [
                    null,
                    48,
                    48,
                    1
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": true,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.000640000042039901,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "sequential_1/batch_normalization_48/gamma",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_48/beta",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_48/moving_mean",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_48/moving_variance",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_49/gamma",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_49/beta",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_49/moving_mean",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_49/moving_variance",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_50/gamma",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_50/beta",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_50/moving_mean",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/batch_normalization_50/moving_variance",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_46/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_46/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_47/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_47/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_48/kernel",
                    "shape": [
                        3,
                        3,
                        64,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_48/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_49/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_49/bias",
                    "shape": [
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_50/kernel",
                    "shape": [
                        3,
                        3,
                        128,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/conv2d_50/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_19/kernel",
                    "shape": [
                        2304,
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_19/bias",
                    "shape": [
                        512
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_20/kernel",
                    "shape": [
                        512,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_20/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_21/kernel",
                    "shape": [
                        256,
                        7
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_21/bias",
                    "shape": [
                        7
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}